Revit 2027 API
ParameterTypeId.RoomDesignLightingLoadPerAreaParam Property
 "Specified Lighting Load per area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomDesignLightingLoadPerAreaParam { get; }
Public Shared ReadOnly Property RoomDesignLightingLoadPerAreaParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomDesignLightingLoadPerAreaParam {
	ForgeTypeId^ get ();
}
static member RoomDesignLightingLoadPerAreaParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace